In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(columns=['Name','Age','Height'])
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [3]:
df.loc[0] = ['Maggie','27','158']
df.loc[1] = ['May','25','175']
df.loc[2] = ['Joe','35','183']

In [4]:
df

     Name Age Height
0  Maggie  27    158
1     May  25    175
2     Joe  35    183

In [5]:
df['Weight'] = [ '75','80','70']

In [6]:
df

     Name Age Height Weight
0  Maggie  27    158     75
1     May  25    175     80
2     Joe  35    183     70

In [7]:
df.drop(['Weight'],axis=1)

     Name Age Height
0  Maggie  27    158
1     May  25    175
2     Joe  35    183

In [8]:
df

     Name Age Height Weight
0  Maggie  27    158     75
1     May  25    175     80
2     Joe  35    183     70

In [9]:
df = df.drop(['Weight'],axis=1)

In [10]:
df

     Name Age Height
0  Maggie  27    158
1     May  25    175
2     Joe  35    183

In [11]:
df.drop(2)

     Name Age Height
0  Maggie  27    158
1     May  25    175

In [12]:
df

     Name Age Height
0  Maggie  27    158
1     May  25    175
2     Joe  35    183

In [13]:
df = df.drop(2)

In [14]:
df

     Name Age Height
0  Maggie  27    158
1     May  25    175

In [15]:
df['Age'][0]

'27'

In [16]:
df['Age'][0] = '23'

In [17]:
df

     Name Age Height
0  Maggie  23    158
1     May  25    175

In [18]:
df['Age'] = '123'

In [19]:
df

     Name  Age Height
0  Maggie  123    158
1     May  123    175

In [20]:
df.loc[0]

Name      Maggie
Age          123
Height       158
Name: 0, dtype: object

In [21]:
df.loc[0]='aaa'

In [22]:
df

  Name  Age Height
0  aaa  aaa    aaa
1  May  123    175

In [23]:
#存檔內容會包含index
df.to_csv('./test.cvs')

In [24]:
#存檔內容不要有index(設0)
df.to_csv('./test.cvs',index=0)

In [25]:
#讀取
df2 = pd.read_csv('./test.cvs')

In [26]:
df2

  Name  Age Height
0  aaa  aaa    aaa
1  May  123    175

In [28]:
columns = ['Name','Age','Heidht']
data = [
    ['Allen','22','175'],
    ['Ted','25','180']
]

df3 = pd.DataFrame(data=data,columns=columns)
df3

    Name Age Heidht
0  Allen  22    175
1    Ted  25    180